// Why did I fall in love with Hori and not the ugly but real girl?

again:
static bool me(string whyami, string isItReallity)
{
    try
    {
        var setting = File.ReadAllText(@"D:\Code\who I am\config\config.isiso");
        var memories = Path.GetFileName(@"D:\Code\who I am\memories\Its bad but its no.txt");
    }
    catch (Exception e)
    {
        // var reason = Console.WriteLine(e);
        Console.WriteLine("There's something wrong."); 
        return false;

    }

    var _me = isItReallity;
    var me = whyami;

    Console.WriteLine(_me, me);

    return true;
}


// /*if (me("luckyFellow", "yes"))
// {
//     // what? idk
// }
//
// // Зачем я тут? 
// // Почему жизнь такая... крайне маленькая и скучная, сегодня я сказал себе, что всё ещё впереди, но, почему...
// // 
// //
// // Что происходит?
// //
// //
// // Я слишком много хочу, мне надо трудится для моих мечт, но, а если всё зря? Зачем я говорю себе: поживёшь - узнаешь? 
// //
// //
// // Всё хорошо, в функцию я передал то, что хочу, потому что не знаю как иначе, иначе - глупо, эти слёзы, фу. Почему она задокументировалась? Она всего-лишь кусочек моих мыслей~
// //
// // Почему мой характер такой, интересный?))))
// //
// //
// // Я буду жить и буду ждать, пока всё будет так, как в Хоримии и не только 
// // Мне интересно, что будет дальше, какие радости меня будут ждать, ну а страданий я конечно не нажрался, думаю в будущем в них будет больше калорий
// //
// // ЖИЗНЬ БУДЕТ ТАКЖЕ ОДНОТОННА, Я ЗНАЮ ЕЁ НАПЕРЁД. когда я думаю об этом и понимаю что это всё, это вся материя, больше самой жизни ничего нет, а ты её знаешь... нет слова, чтобы описать это
// //
// //
// // Как же много зависит от настроения, сейчас я не грани двух реалей, одна мне говорит что не спеши, всё ещё будет и она права, но вторая говорит - нет, всё будет так как ты думаешь, так было всегда и никто не замечал, так и продолжится
// //
// // Исходя из эмоций, сейчас мне более подходит второй вариант. Я успокаиваюсь, когда думаю о том, что это всё эмоции, спасибо
// // Программа ничего не выводит, потому что я на самом деле ничего не знаю.

// // ///////////////////////////
// //   私はなんという狂人なのだろう。
// //   world.justExecute(me);
// // ///////////////////////////
// */